# Создать класс Date, который имеет следующие поля:
# - день
# - месяц
# - год
# Все поля должны быть помечены модификатором private
# - реализовать доступ к полям через методы set и get
# - * реализовать статический метод checkData(int day, int month, int year),
# который проверяет существование введенной даты
# - * использовать проверку checkData, при попытке изменить поле
# метод set, в случае ошибки не проводить изменение, а вывести сообщение
# об ошибке на консоль
# - ** реализовать метод differenceIdDays(day: int, month: int, year: int), который
# принимает другую дату и вычисляет разницу в днях между датами
# - протестировать работу методов
