# Реализовать программу возведения числа в квадрат.
# 		- прочитать число с консоли
# 		- вывести введенное число
# 		- вывести число, возведенной в квадрат
a = int(input())
print(a)
print(a**2)