#6) Написать функцию get_words(), которая подсчитывает количество слов в тексте.
# (В тексте может быть несколько предложений со знаками пунктуации


def get_words(txt=(input("input text"))):
    lst_Char = [",", ".", "-"," ","!","?",":",";","(",")","\""]
    for i in lst_Char:
        txt.replace(i," ")
    return len(txt.split(" "))


print(get_words())
#","|"."|" "|"!"|"?"
# ",", ".", "-"," ","!","?",":",";","(",")","\""