# Выведите первый и последний элемент строки
a = 'Hello'
print(a[0], a[-1])