# Задание 9 Посчитайте, сколько раз символ встречается в строке.
str = "Sample apple"
letter = "a"
a = 0

for character in str:
    if character == letter:
        a += 1
print("Символ втречается в строке раз:", a)




