#Задание2 Передайте два числа в виде строки и выведите сумму чисел
number_1 = '88'
number_2 = '789'
print("Cумма двух чисел равна:", int(number_1) + int(number_2))