# Задание 6 Инициализировать две переменные. Поменять их значения местами (не вводя третью)
var_1 = 66
var_2 = 877
var_1, var_2 = var_2, var_1
print("Переменная var_1 =", var_1)
print("Переменная var_2 =", var_2)
