#Задание 8 В переменных q и w хранятся два натуральных числа.
#Создайте программу, выводящую на экран результат деления q на w с остатком.
q = 98
w = 55
c = q % w
print("Результат деления с остатком =", c)