# Задание 3 Реализовать программу возведения числа в квадрат.
#	- прочитать число с консоли
#	- вывести введенное число
#	- вывести число, возведенной в квадрат
number = int(input("Введите число:"))
print("Вы ввели число:", number)
print("Квадрат введенного числа равен: =", number**2)

