# Задание 6 Инициализировать две переменные. Поменять их значения местами
var_1 = 78
var_2 = 355
var_3 = var_2
var_2 = var_1
print("Переменная var_1 =", var_3)
print("Переменная var_2 =", var_1)

