#  Выведите первый и последний элемент строки

a = 'Hello World'
print(a[0], a[-1])
